// pages/chat/chat.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    gradualColor: ['red', '#4a67d6'],
    wenti:[
      {
      question:"这个小程序是谁开发的？",
      answer:"本项目全权由大连东软信息学院，计算机与软件学院，软件与大数据技术系，软件工程专业师生研发。"
    },
    {
      question:"请介绍一下刘家村",
      answer:"刘家村位于大连市甘井子区红旗街道西南部，坐落于大连西郊国家森林公园内，是一个狭长条带式山村，距离城区5公里。秉承“创新、担当、绿色、共享”的发展理念，始终坚持优化生态环境，在保护中求得发展，在发展中兼顾保护的发展总基调，勇于开拓，敢于争先，扛起乡村经济建设的重担，走出新时代下的别样乡村发展之路。"
    },
    {
      question:"用户问题3",
      answer:"刘家村回答3"
    },
    {
      question:"用户问题4",
      answer:"刘家村回答4"
    }
  ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})