// pages/newsDetail/newsDetail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    skeletonShow: true,
    detail:{
      content:"测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！测试刘家村活动！！",
      title:"村内演唱会",
      publish_date:"10-25",
      author:"村党委"
    },
    shuju:[
      {
        content:"为扎开展基层党组织联建共建工作，充分发挥基层党组织优势特色，巩固党史学习教育成果，区局各党支部主动做好支部结对联系的组织工作，围绕“组织联建、优势互补、共谋发展”的总目标，进一步提升党组织凝聚力、战斗力、创造力，以高质量党建引领促进共同发展.区局党委纪检组党支部和第四税务所党支部于9月23日，由支部书记带队，与南京东路街道顺天村居民区党总支举行了支部结对共建签约仪式，并深入了解了该居民区的基本情况和在全国文明城区创建工作中的痛点难点。区局党员干部纷纷表示将以结对共建为契机，积极下沉到社区服务一线，配合社区共同参与文明城区创建，进一步发挥基层党建在社区治理中的基础性作用。顺天村居民区主任表示，此次结对共建增进了双方党支部的联系和交流，社区将进一步凝聚黄浦税务党组织的力量，发挥党建结对的强大合力，共建共享文明城区创建，全面提升党建引领社区治理的能力和水平。",
        title:"党建活动",
        publish_date:"10-11",
        author:"村党委"
      },
      {
        content:"<p style='margin-bottom: 15px;'>位于大连市郊的刘家村，拥有着悠久的历史和丰富的文化底蕴。这里地理位置优越，环境优美，是众多游客夏日游玩的好去处。本文将带您领略刘家村的自然风光、美食、民俗风情以及未来发展，让您在炎炎夏日里找到一个理想的旅游胜地。</p><h3>乡村旅游</h3><p style='margin-bottom: 15px;'>刘家村依山傍水，自然风光优美。游客可以在这里漫步于乡间小路，欣赏田野间的美景，感受大自然的魅力。此外，还可以游览村落周边的历史文化景点，如古庙、古井等，领略传统文化的韵味。</p><h3>民宿体验</h3><p style='margin-bottom: 15px;'>刘家村内有许多风格各异的民宿，游客可以在这里感受不同的住宿体验。在民宿中，游客可以品尝当地美食，还可以与当地居民交流互动，深入了解当地的文化和生活。</p><h3>美食之旅</h3><p style='margin-bottom: 15px;'>刘家村的美食种类繁多，其中以当地的海鲜、蔬菜和水果最为著名。在这里，游客可以品尝到新鲜的海蛎子、大黄鱼、樱桃、杏子等美味佳肴。此外，还可以参加当地举办的美食节活动，体验更加丰富多彩的美食之旅。</p>",
        title:"夏日游玩",
        publish_date:"10-13",
        author:"村党委"
      },
      {
        content:"<p style='margin-bottom: 15px;'>当夏日的热烈逐渐消退，秋天的轻爽便悄然而至。位于大连市郊的刘家村，此时更显出多彩的风貌。丰收的田野、金黄的落叶和丰富的果实，都为这个季节的刘家村增添了别样的魅力。本文将带您领略刘家村秋日的多彩画卷，感受这个丰收季节的韵味。</p><h3>田野风光</h3><p style='margin-bottom: 15px;'>秋天的刘家村，田野里一片金黄。稻谷、玉米、大豆等农作物成熟，满目都是丰收的喜悦。游客可以在这里欣赏到壮观的稻田景观，还可以参与农耕活动，体验收获的乐趣。</p><h3>银杏大道</h3><p style='margin-bottom: 15px;'>刘家村内的银杏大道是秋天的一大亮点。数百米的道路上，两旁的银杏树披上金黄色的外衣，形成了一条美丽的彩带。游客可以漫步其间，感受那浓郁的秋意和诗意。</p><h3>山林红叶</h3><p style='margin-bottom: 15px;'>刘家村四周的山林在秋天变得如诗如画。红叶、黄叶与绿叶交织在一起，构成了一幅美丽的画卷。游客可以在这里进行徒步旅行，欣赏那五彩斑斓的山林秋色。</p>",
        title:"刘家秋日",
        publish_date:"10-15",
        author:"村宣传"
      },
      {
        content:"<p style='margin-bottom: 15px;'>“晨曦咖啡馆”位于市中心繁华的商业街区，交通便利，环境优雅。我们以“让生活慢下来”为经营理念，致力于为顾客提供舒适、温馨的咖啡时光。</p><p style='margin-bottom: 15px;'>走进咖啡馆，你会被我们独特的装修风格所吸引。淡雅的色调、精致的摆设和舒适的沙发座椅，让你仿佛置身于一个远离喧嚣的小世界。我们的特色饮品包括手工咖啡、创意茶饮和丰富的点心，每款都是经过精心研发，让你在品尝的同时，感受到我们对品质的执着追求。</p><p style='margin-bottom: 15px;'>“晨曦咖啡馆”的优势在于我们的专业服务团队和精湛的咖啡技艺。我们的员工队伍热情友好，专业素养高，随时为你提供周到的服务。此外，我们还注重提升员工的技能和知识，定期进行培训和考核，以确保每位顾客都能享受到高品质的咖啡体验。</p><p style='margin-bottom: 15px;'>作为一家深受欢迎的咖啡馆，我们期望在未来能够拓展更多的业务领域。我们将不断探索新的饮品和食品种类，以满足不同顾客的需求。同时，我们还将致力于提升品牌形象，通过举办各类文化活动、增加会员制度等方式，吸引更多的顾客光临我们的咖啡馆。</p><p style='margin-bottom: 15px;'>总之，“晨曦咖啡馆”是你闲暇时光的好去处，让我们一起在这里享受美好的咖啡时光，共同感受生活的美好！</p>",
        title:"咖啡记忆",
        publish_date:"10-19",
        author:"村宣传"
      },
    ]
  },
  
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {
    this.setData({
      detail:this.data.shuju[options.id]
    });
    setTimeout(() => {
      this.setData({
        skeletonShow:false
      })
    }, 1800);
  },
  getaction(){
    wx.navigateTo({
      url: '../actionApplication/actionApplication',
    })
  },
  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  },
  onShareTimeline(){

  }
})